&НаСервере
Процедура БНС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	НоваяКоманда = ЭтаФорма.Команды.Добавить("БНС_ЗаполнитьКодыМаркировкиПоОстаткам");
	НоваяКоманда.Заголовок = "(БНС) Заполнить коды маркировки по остаткам";
	НоваяКоманда.Действие = "БНС_ЗаполнитьКодыМаркировкиПоОстаткам";

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("БНС_ЗаполнитьКодыМаркировкиПоОстаткам", Тип("КнопкаФормы"), Элементы.ТоварыЗаполнить);
	НовыйЭлемент.Заголовок = "(БНС) Заполнить коды маркировки по остаткам";
	НовыйЭлемент.ИмяКоманды = "БНС_ЗаполнитьКодыМаркировкиПоОстаткам";

	НоваяКоманда = ЭтаФорма.Команды.Добавить("БНС_ОчиститьКодыМаркировки");
	НоваяКоманда.Заголовок = "(БНС) Очистить коды маркировки";
	НоваяКоманда.Действие = "БНС_ОчиститьКодыМаркировки";

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("БНС_ОчиститьКодыМаркировки", Тип("КнопкаФормы"), Элементы.ТоварыЗаполнить);
	НовыйЭлемент.Заголовок = "(БНС) Очистить коды маркировки";
	НовыйЭлемент.ИмяКоманды = "БНС_ОчиститьКодыМаркировки";

КонецПроцедуры

&НаКлиенте
Процедура БНС_ОчиститьКодыМаркировки(Команда)

	ТекстВопроса = НСтр("ru = 'Очистить табличную часть кодов маркировки?'");
	Оповещение = Новый ОписаниеОповещения("БНС_ВопросПередОчисткойТабличнойЧастиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);

КонецПроцедуры

&НаКлиенте
Процедура БНС_ВопросПередОчисткойТабличнойЧастиЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		БНС_ОчиститьКодыМаркировкиНаСервере();
		Модифицированность = Истина;
		ПоказатьОповещениеПользователя("Коды маркировки очищены", ,
			"Табличная часть маркировки документа очищена.",
			БиблиотекаКартинок.Информация, СтатусОповещенияПользователя.Информация);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БНС_ЗаполнитьКодыМаркировкиПоОстаткам(Команда)

	Если Модифицированность Тогда
		Записать();
	КонецЕсли;

	ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть кодов маркировки будет очищена. Продолжить?'");
	Оповещение = Новый ОписаниеОповещения("БНС_ВопросПередЗаполнениемТабличнойЧастиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);

КонецПроцедуры

&НаКлиенте
Процедура БНС_ВопросПередЗаполнениемТабличнойЧастиЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		РезультатЗаполнения = БНС_ЗаполнитьКодыМаркировкиПоОстаткамНаСервере();
		Модифицированность = Истина;

		Если РезультатЗаполнения.Недозаполнено Тогда
			ЗаголовокОповещения = "Маркировка заполнена частично";
		Иначе
			ЗаголовокОповещения = "Коды маркировки успешно заполнены";
		КонецЕсли;

		ПоказатьОповещениеПользователя(ЗаголовокОповещения, , РезультатЗаполнения.Сообщение,
			БиблиотекаКартинок.Информация, СтатусОповещенияПользователя.Информация);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура БНС_ОчиститьКодыМаркировкиНаСервере()

	Объект.ШтрихкодыУпаковок.Очистить();
	БНС_ОбщегоНазначенияГИСМ.ПересчитатьСтатусыМаркировкиРеализации(Объект);

КонецПроцедуры

&НаСервере
Функция БНС_ЗаполнитьКодыМаркировкиПоОстаткамНаСервере()

	// ++ БНС_БереговойНС 27.09.2026
	СтруктураРезультатов = БНС_ОбщегоНазначенияГИСМ.ПолучитьСвободнуюМаркировку(Объект.Ссылка);
	
	ТзнОбщие = СтруктураРезультатов.ТзнОбщий;
	ТзнКоды  = СтруктураРезультатов.ТзнКоды;
	
	Для Каждого СтрПроверка Из ТзнОбщие Цикл
		
		Если СтрПроверка.Остаток >= СтрПроверка.Количество Тогда
			
			Счетчик = СтрПроверка.Количество;
			МассивКодов = ТзнКоды.НайтиСтроки(Новый Структура("Номенклатура", СтрПроверка.Номенклатура));
			Для Каждого СтрКод Из МассивКодов Цикл
				
				Если СтрКод.Остаток > 1 Тогда
					Сообщить("Упаковка, пропускаю код: " + СтрКод.ШтрихкодУпаковки);
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = Объект.ШтрихкодыУпаковок.Добавить();	
				НоваяСтрока.ШтрихкодУпаковки = СтрКод.ШтрихкодУпаковки;
				
				Счетчик = Счетчик - СтрКод.Остаток;
				Если Счетчик <= 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			ОбщегоНазначения.СообщитьПользователю("Нет маркировки: " + Объект.Ссылка + ", по товару: " + СтрПроверка.Номенклатура);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // -- БНС_БереговойНС 27.09.2026

