////////////////////////////////////////////////////////////////////////////////
//
// БНС_ОбщегоНазначенияГИСМ: серверные процедуры и функции подсистемы "ГИСМ"
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс


#Область ПодпискиНаСобытия


Процедура ДокументПриПроведении(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Не БНС_ОбщегоНазначенияГИСМПовтИсп.ВестиУчетГИСМ() Тогда
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		
		Движения = Источник.Движения;
		Движения.БНС_ОстаткиИСМП.Записывать = Истина;
		Движения.БНС_ОстаткиИСМП.Очистить();
		
		Для Каждого Строка Из Источник.ШтрихкодыУпаковок Цикл
			
			Движение = Движения.БНС_ОстаткиИСМП.Добавить();
			Движение.ВидДвижения        = ВидДвиженияНакопления.Приход;
			Движение.Период             = Источник.Дата;
			Движение.Регистратор        = Источник.Ссылка;
			
			ШтрихкодУпаковки = Строка.ШтрихкодУпаковки;
			Движение.ШтрихкодУпаковки    = ШтрихкодУпаковки;
			Движение.Номенклатура        = ШтрихкодУпаковки.Номенклатура;
			Движение.Количество          = ШтрихкодУпаковки.Количество;	
			Движение.ОбъемноСортовойУчет = ОбъемноСортовойУчет(ШтрихкодУпаковки.Номенклатура);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Движения = Источник.Движения;
		Движения.БНС_ОстаткиИСМП.Записывать = Истина;
		Движения.БНС_ОстаткиИСМП.Очистить();
		
		Для Каждого Строка Из Источник.ШтрихкодыУпаковок Цикл
			
			Движение = Движения.БНС_ОстаткиИСМП.Добавить();
			Движение.ВидДвижения        = ВидДвиженияНакопления.Расход;
			Движение.Период             = Источник.Дата;
			Движение.Регистратор        = Источник.Ссылка;
			
			ШтрихкодУпаковки = Строка.ШтрихкодУпаковки;
			Движение.ШтрихкодУпаковки    = ШтрихкодУпаковки;
			Движение.Номенклатура        = ШтрихкодУпаковки.Номенклатура;
			Движение.Количество          = ШтрихкодУпаковки.Количество;
			Движение.ОбъемноСортовойУчет = ОбъемноСортовойУчет(ШтрихкодУпаковки.Номенклатура);
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСвободнуюМаркировку(СсылкаНаОбъект) Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_Документ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Номенклатура В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ОписаниеНоменклатурыИС.Номенклатура КАК Номенклатура
	               |			ИЗ
	               |				РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС)
	               |	И РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	               |	И РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документ.Номенклатура КАК Номенклатура,
	               |	ВТ_Документ.Количество КАК Количество,
	               |	ЕСТЬNULL(БНС_ОстаткиИСМПОстатки.КоличествоОстаток, 0) КАК Остаток
	               |ИЗ
	               |	ВТ_Документ КАК ВТ_Документ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БНС_ОстаткиИСМП.Остатки(&ДатаДокумента, ) КАК БНС_ОстаткиИСМПОстатки
	               |		ПО ВТ_Документ.Номенклатура = БНС_ОстаткиИСМПОстатки.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документ.Номенклатура КАК Номенклатура,
	               |	ВТ_Документ.Количество КАК Количество,
	               |	БНС_ОстаткиИСМПОстатки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	               |	ЕСТЬNULL(БНС_ОстаткиИСМПОстатки.КоличествоОстаток, 0) КАК Остаток
	               |ИЗ
	               |	ВТ_Документ КАК ВТ_Документ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БНС_ОстаткиИСМП.Остатки(&ДатаДокумента, ) КАК БНС_ОстаткиИСМПОстатки
	               |		ПО ВТ_Документ.Номенклатура = БНС_ОстаткиИСМПОстатки.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	БНС_ОстаткиИСМПОстатки.Номенклатура,
	               |	БНС_ОстаткиИСМПОстатки.ШтрихкодУпаковки.ДатаУпаковки
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.НайтиПоКоду("БП-00013022"));
	
	МоментДокумента = СсылкаНаОбъект.МоментВремени();
	ГраницаВключая = Новый Граница(МоментДокумента, ВидГраницы.Включая);
	
	Запрос.УстановитьПараметр("ДатаДокумента", ГраницаВключая);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат.Вставить("ТзнОбщий", РезультатЗапроса[1].Выгрузить());
	Результат.Вставить("ТзнКоды" , РезультатЗапроса[2].Выгрузить());
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция ОбъемноСортовойУчет(НоменклатураСсылка)
	
	// 1. Получаем описание номенклатуры через кэш подсистемы ИС
	ДанныеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(НоменклатураСсылка);
	ОписаниеНоменклатуры = ДанныеНоменклатуры[НоменклатураСсылка];
	
	ВидПродукцииГИСМТ = Справочники.ВидыПродукцииИС.ПустаяСсылка();
	
	// 2. Извлекаем Вид продукции ГИСМТ из полученного ключа
	Если ЗначениеЗаполнено(ОписаниеНоменклатуры.КлючВидовПродукции) Тогда
		ВидПродукцииГИСМТ = КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииКлючаПоПодсистеме(
		ОписаниеНоменклатуры.КлючВидовПродукции, 
		"ГИСМТ"
		);
	КонецЕсли;
	
	// 3. Штатная проверка: использует ли этот вид продукции объемно-сортовой учет (ОСУ)
	ЭтоОСУ = КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииИспользуетОбъемноСортовойУчет(ВидПродукцииГИСМТ);
	
	Возврат ЭтоОСУ;
	
КонецФункции

Функция НЭП_ОбъемноСортовойУчет(НоменклатураСсылка)
	
	// 1. Получаем описание номенклатуры через кэш подсистемы ИС
	ДанныеНоменклатуры   = ОбщегоНазначенияИС.ОписаниеНоменклатуры(НоменклатураСсылка);
	ОписаниеНоменклатуры = ДанныеНоменклатуры[НоменклатураСсылка];
	
	ВидПродукцииГИСМТ    = Справочники.ВидыПродукцииИС.ПустаяСсылка();
	
	// 2. Извлекаем Вид продукции ГИСМТ из полученного ключа
	Если ЗначениеЗаполнено(ОписаниеНоменклатуры.КлючВидовПродукции) Тогда
		ВидПродукцииГИСМТ = КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииКлючаПоПодсистеме(
		ОписаниеНоменклатуры.КлючВидовПродукции, 
		"ГИСМТ");
	КонецЕсли;  
			
	// 3. Штатная проверка: использует ли этот вид продукции объемно-сортовой учет (ОСУ)
	ЭтоОСУ = КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииИспользуетОбъемноСортовойУчет(ВидПродукцииГИСМТ);
	
		
	Возврат ЭтоОСУ;
	
КонецФункции


#КонецОбласти